In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\python\lib\site-packages (2.1.2)
Requirement already satisfied: numpy<2,>=1.23.2 in c:\python\lib\site-packages (from pandas) (1.26.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\python\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\python\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\python\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
import glob 
from datetime import datetime

In [3]:
def extract_from_json(file_to_process):
    dataframe = pd.read_json(file_to_process)
    return dataframe

In [4]:
jsonfile1 = pd.read_json('bank_market_cap_1.json')
jsonfile1.head(10)

                                      Name  Market Cap (US$ Billion)
0                           JPMorgan Chase                   390.934
1  Industrial and Commercial Bank of China                   345.214
2                          Bank of America                   325.331
3                              Wells Fargo                   308.013
4                  China Construction Bank                   257.399
5                        HSBC Holdings PLC                   219.270
6               Agricultural Bank of China                   203.244
7                           Citigroup Inc.                   203.165
8                            Bank of China                   181.469
9                     China Merchants Bank                   122.616

In [5]:
jsonfile1.shape

(70, 2)

In [6]:
jsonfile2 = pd.read_json('bank_market_cap_2.json')
jsonfile2.head(10)

                                Name  Market Cap (US$ Billion)
35   Banco Bilbao Vizcaya Argentaria                    60.678
36                   Japan Post Bank                    60.525
37       The Bank of New York Mellon                    59.823
38  Shanghai Pudong Development Bank                    58.796
39           Industrial Bank (China)                    57.388
40         Bank of China (Hong Kong)                    55.449
41                  Bank of Montreal                    53.181
42                   Crédit Agricole                    52.141
43                          DBS Bank                    51.475
44                            Nordea                    51.185

In [7]:
jsonfile2.shape

(35, 2)

In [8]:
columns = ["Name", "Market Cap (US$ Billion)"]
def extract2():
    extracted_data = pd.DataFrame(columns = columns)
    for jsonfile in glob.glob("*.json"):
        extracted_data = extracted_data._append(extract_from_json(jsonfile), ignore_index=True)
        return extracted_data

In [9]:
my_extracted_df1 = extract2()
my_extracted_df1

C:\Users\schennu\AppData\Local\Temp\ipykernel_3372\3413932589.py:5: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  extracted_data = extracted_data._append(extract_from_json(jsonfile), ignore_index=True)

                                       Name  Market Cap (US$ Billion)
0                            JPMorgan Chase                   390.934
1   Industrial and Commercial Bank of China                   345.214
2                           Bank of America                   325.331
3                               Wells Fargo                   308.013
4                   China Construction Bank                   257.399
..                                      ...                       ...
65                             Ping An Bank                    37.993
66                       Standard Chartered                    37.319
67                     United Overseas Bank                    35.128
68                                QNB Group                    33.560
69                              Bank Rakyat                    33.081

[70 rows x 2 columns]

In [10]:
def extract():
    extracted_data = pd.concat([jsonfile1, jsonfile2])
    return extracted_data
my_extracted_df = extracted_data

In [11]:
dataframe = pd.read_csv("exchange_rates.csv", index_col = 0)
dataframe.head(10)

         Rates
AUD   1.297088
BGN   1.608653
BRL   5.409196
CAD   1.271426
CHF   0.886083
CNY   6.483139
CZK  21.510117
DKK   6.119757
EUR   0.822504
GBP   0.732398

In [12]:
def read_csv(file_to_process):
    dataframe = pd.read_csv(file_to_process, index_col = 0)
    return dataframe

def extract_csv():
    for csvfile in glob.glob("*.csv"):
        extracted_csv_data = pd.DataFrame(read_csv(csvfile))
    return extracted_csv_data

In [13]:
my_csv_extracted = extract_csv()
my_csv_extracted.head(10)

         Rates
AUD   1.297088
BGN   1.608653
BRL   5.409196
CAD   1.271426
CHF   0.886083
CNY   6.483139
CZK  21.510117
DKK   6.119757
EUR   0.822504
GBP   0.732398

In [14]:
exchange_rate = float(my_csv_extracted.loc["GBP"])
exchange_rate

C:\Users\schennu\AppData\Local\Temp\ipykernel_3372\1698696865.py:1: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  exchange_rate = float(my_csv_extracted.loc["GBP"])

0.7323984208000001

In [15]:
def transform(data):
    data["Market Cap (US$ Billion)"] = round(data["Market Cap (US$ Billion)"] * exchange_rate, 3)
    data.rename(columns = {"Name": "Name", "Market Cap (US$ Billion)" : "Market Cap (GBP Billion)"}, inplace =True, errors = "raised")
    return data

In [16]:
my_tranformed_df = transform(my_extracted_df)
my_tranformed_df.head(10)

NameError: name 'my_extracted_df' is not defined

In [ ]:
#filename = "bank_market_cap_gbp.csv"
def load(filename,data):
    data.to_csv(filename, index = False)

In [ ]:
timestamp = datetime.now().strftime("Date: %h %d, %Y - Time: %H:%M:%S")
timestamp

In [ ]:
logfilename = "bmc_log.txt"
def log(message):
    timestamp = datetime.now().strftime("Date: %h %d, %Y - Time: %H:%M:%S")
    with open(logfilename, "a") as txtfile:
        txtfile.write(f"{timestamp} : {message}. \n")

In [ ]:
log("ETL Job Started")
log("Extraction Phase Started")

In [ ]:
extractedData = extract()
extractedData.head(5)

In [ ]:
log("ETL Job Ended")
log("Transform Phase Started")

In [ ]:
transaformedData =transform(extractedData)
transaformedData.head(5)

In [ ]:
log("Transform Job Ended")
log("Loading Phase Started")

In [ ]:
load("bank_market_cap_gbp.csv",transaformedData)

In [ ]:
log("Load Job Ended")